*** System Preparation

Please follow the Asahi Fedora Remix [[https://docs.fedoraproject.org/en-US/fedora-asahi-remix/installation/][installation guide]] and install
one of the /Minimal/, /Sever/, /Gnome/ or /KDE Plasma/ operating
systems on your device, as well as an /UEFI only environment/.

Once the Asahi Fedora Remix and the UEFI only environment are
installed, your disk should look similar to this:

#+begin_src sh :exports both :dir /sudo:: :results verbatim
  sudo fdisk --list /dev/nvme0n1
#+end_src

#+RESULTS:
#+begin_example
Disk /dev/nvme0n1: 1.82 TiB, 2001111162880 bytes, 488552530 sectors
Disk model: APPLE SSD APXXXXX
Units: sectors of 1 * 4096 = 4096 bytes
Sector size (logical/physical): 4096 bytes / 4096 bytes
I/O size (minimum/optimal): 4096 bytes / 4096 bytes
Disklabel type: gpt
Disk identifier: XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX

Device              Start       End   Sectors   Size Type
/dev/nvme0n1p1          6    128005    128000   500M unknown
/dev/nvme0n1p2     128006  24542067  24414062  93.1G Apple APFS
/dev/nvme0n1p3   24542068  25152371    610304   2.3G Apple APFS
/dev/nvme0n1p4   25152372  25274483    122112   477M EFI System
/dev/nvme0n1p5   25274484 195440499 170166016   100G Linux filesystem
/dev/nvme0n1p6  195440500 196050803    610304   2.3G Apple APFS
/dev/nvme0n1p7  196050804 196172915    122112   477M EFI System
/dev/nvme0n1p11 487241816 488552524   1310709     5G unknown

Partition table entries are not in disk order.
#+end_example

The =/dev/nvme0n1p3= partition is the [[https://en.wikipedia.org/wiki/Apple_File_System][APFS]] container of the /Asahi
Fedora Remix/ installation, =/dev/nvme0n1p4= its EFI system partition,
and =/dev/nvme0n1p5= the root partition.

Next comes =/dev/nvme0n1p6=, which is the APFS container of the /UEFI
only environment/, along with its EFI system partition
=/dev/nvme0n1p7=. The root partition of the Guix system itself will be
created during the manual installation or via the installer.

Finally there is the =/dev/nvme0n1p11= partition, which contains the
Apple recovery system, which should *not* be touched or moved around.

Boot into Fedora Asahi Remix, [[https://guix.gnu.org/manual/en/html_node/Installation.html][install]] the Guix package manager and
follow either the manual installation (recommended) or the Guix
Installer section of this guide.

**** System configuration

First, lookup the filesystem UUID of the EFI system partition
=/dev/nvme0n1p7= from the /UEFI only environment/.

#+begin_src sh :exports both :results verbatim
  sudo blkid | grep /dev/nvme0n1p7 | sed -n 's/.* UUID="\([^"]*\)".*/\1/p'
#+end_src

#+RESULTS:
#+begin_example
86E8-4498
#+end_example

Create a file called =asahi-guix.scm= and instantiate a Guix operating
system record, configured with the filesystem UUID of your EFI system
partition. In this example, the filesystem UUID is =86E8-4498=.

#+begin_src scheme
  (use-modules (asahi guix systems base) (gnu))

  (operating-system
    (inherit asahi-base-os)
    (file-systems (cons* (file-system
                           (device (uuid "86E8-4498" 'fat32))
                           (mount-point "/boot/efi")
                           (needed-for-boot? #t)
                           (type "vfat"))
                         (file-system
                           (device (file-system-label "asahi-guix-root"))
                           (mount-point "/")
                           (needed-for-boot? #t)
                           (type "btrfs"))
                         %base-file-systems)))
#+end_src

Build the Guix operating system.

#+begin_src sh
  guix system build --load-path=modules asahi-guix.scm
#+end_src

If the operating system builds successfully, we can proceed by
installing the operating system onto the hard drive.

